
def bubble_sort(lst):
    counter = 0 # обнуляем счётчик

    while counter < len(lst): # цикл длится пока значение счётчика меньше длины списка
        for i in range(0, len(lst) - 1): # вложенный цикл используется, чтобы 'пройти по списку' несколько раз
            if lst[i] > lst[i+1]: # сравниваем текущий элемент списка с последующим
                lst[i],lst[i+1] = lst[i+1],lst[i] # если текущий элменет больше, меняем его местами с последующим
        counter += 1 # по окончании цикла for переходим к след.элементу списка, увеличивая счётчик
    return lst # по окончании цикла while выводим обработанный список
